apps/udemy1/app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."is_remote" = ? ORDER BY created_at DESC  [["is_remote", 1]]
---
	def index
		is_remote = params[:is_remote]

		if is_remote
			@profiles = Profile.last_published.where({is_remote: is_remote})