apps/udemy1/app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" ORDER BY created_at DESC
---
	def index
		@profiles = Profile.all

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
		@profile = Profile.find(params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def edit
		@profile = Profile.find(params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "alias" = ?, "price" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["alias", "the felix profile 1"], ["price", 3], ["updated_at", "2019-07-30 12:23:27.200415"], ["id", 1]]
---
	def update
		@profile = Profile.find(params[:id])
		if @profile.update(profile_params)

INSERT INTO "profiles" ("alias", "description", "is_remote", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["alias", "OtherFelix"], ["description", "lorem "], ["is_remote", 1], ["price", 2], ["user_id", 2], ["created_at", "2019-07-30 12:29:14.537440"], ["updated_at", "2019-07-30 12:29:14.537440"]]
---
	def create
		@profile = Profile.new(profile_params)
		@profile.user = current_user
		if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 2]]
---
	def destroy
		@profile = Profile.find(params[:id])
		@profile.destroy

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_profile
		@profiles = Profile.find(params[:id])