apps/udemy1/app/controllers/search_controller.rb

SELECT "profiles".* FROM "profiles" WHERE (alias LIKE '%' or description LIKE '%' )
---
	def index
		keyword = "%#{params[:q]}"

		@profiles = Profile.where(["alias LIKE ? or description LIKE ? ", keyword, keyword])