apps/udemy1/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bolivar@mail.com"], ["LIMIT", 1]]
---
  	def create
  		user = User.find_by(email: params[:email])